Revit 2027 API
Stone.StonePatternAmount Property
 The property labeled "Amount" from the "Stone" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string StonePatternAmount { get; }
Public Shared ReadOnly Property StonePatternAmount As String
	Get
public:
static property String^ StonePatternAmount {
	String^ get ();
}
static member StonePatternAmount : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 2".
See Also
Reference
Stone Class
Autodesk.Revit.DB.Visual Namespace